damellis/netwidget/Arduino/hardware/sanguino/avr/boards.txt
############################################################

atmega644.name=Sanguino W/ ATmega644P

atmega644.upload.protocol=arduino
atmega644.upload.maximum_size=63488
atmega644.upload.speed=57600
atmega644.upload.tool=arduino:avrdude

atmega644.bootloader.low_fuses=0xFF
atmega644.bootloader.high_fuses=0xDA
atmega644.bootloader.extended_fuses=0xFF
atmega644.bootloader.file=atmega/ATmegaBOOT_168_atmega644p.hex
#atmega644.bootloader.file=atmega/ATmegaBOOT_644P.hex
atmega644.bootloader.unlock_bits=0x3F
atmega644.bootloader.lock_bits=0x0F
atmega644.bootloader.tool=arduino:avrdude

atmega644.build.mcu=atmega644p
atmega644.build.f_cpu=16000000L
atmega644.build.core=arduino:arduino
atmega644.build.variant=standard
##############################################################

atmega12848m.name=Sanguino W/ ATmega1284p 8mhz

atmega12848m.upload.protocol=arduino
atmega12848m.upload.maximum_size=131072
atmega12848m.upload.speed=19200
atmega12848m.upload.tool=arduino:avrdude

atmega12848m.bootloader.low_fuses=0xFD
atmega12848m.bootloader.high_fuses=0xDA
atmega12848m.bootloader.extended_fuses=0xFF
atmega12848m.bootloader.file=atmega/ATmegaBOOT_168_atmega1284p_8m.hex
atmega12848m.bootloader.unlock_bits=0x3F
atmega12848m.bootloader.lock_bits=0x0F
atmega12848m.bootloader.tool=arduino:avrdude

atmega12848m.build.mcu=atmega1284p
atmega12848m.build.f_cpu=8000000L
atmega12848m.build.core=arduino:arduino
atmega12848m.build.variant=standard

##############################################################

atmega1284.name=Sanguino W/ ATmega1284p 16mhz

atmega1284.upload.protocol=arduino
atmega1284.upload.maximum_size=131072
atmega1284.upload.speed=57600
atmega1284.upload.tool=arduino:avrdude

atmega1284.bootloader.low_fuses=0xFF
atmega1284.bootloader.high_fuses=0xDA
atmega1284.bootloader.extended_fuses=0xFF
atmega1284.bootloader.file=atmega/ATmegaBOOT_168_atmega1284p.hex
atmega1284.bootloader.unlock_bits=0x3F
atmega1284.bootloader.lock_bits=0x0F
atmega1284.bootloader.tool=arduino:avrdude

atmega1284.build.mcu=atmega1284p
atmega1284.build.f_cpu=16000000L
atmega1284.build.core=arduino:arduino
atmega1284.build.variant=standard
#
